; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	spectrograph3 - mode
	thermograph1 - mode
	spectrograph4 - mode
	spectrograph2 - mode
	image0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	Star4 - direction
	GroundStation6 - direction
	Star7 - direction
	GroundStation3 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph3)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star7)
	(supports instrument2 image0)
	(supports instrument2 spectrograph4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite0 Planet12)
	(have_image Phenomenon8 spectrograph3)
	(have_image Planet9 thermograph1)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Planet12 thermograph1)
	(have_image Phenomenon13 spectrograph4)
	(have_image Star14 spectrograph2)
))

)

; plan
1. (turn_to satellite1 groundstation3 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon8 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon8)
   goals met: 0 of 8
5. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 0 of 8
6. (take_image satellite1 phenomenon8 instrument3 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 1 of 8
7. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 8
8. (calibrate satellite0 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 1 of 8
9. (turn_to satellite0 phenomenon10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon10)
   goals met: 1 of 8
10. (take_image satellite0 phenomenon10 instrument2 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon13 instrument2 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 3 of 8
13. (turn_to satellite0 star11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star11)
   goals met: 3 of 8
14. (take_image satellite0 star11 instrument2 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 4 of 8
15. (turn_to satellite0 star14 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star14)
   goals met: 4 of 8
16. (take_image satellite0 star14 instrument2 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 5 of 8
17. (turn_to satellite0 planet12 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 planet12)
   goals met: 6 of 8
18. (turn_to satellite1 planet12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet12)
   goals met: 6 of 8
19. (take_image satellite1 planet12 instrument3 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 7 of 8
20. (turn_to satellite1 planet9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet9)
   goals met: 7 of 8
21. (take_image satellite1 planet9 instrument3 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 8 of 8
